#### How to create python pandas dataframe

In [1]:
import pandas as pd

In [3]:
empty_dff = pd.DataFrame()
print(empty_dff)

Empty DataFrame
Columns: []
Index: []

In [4]:
lst = ['a', 'b', 'c']
print(lst)

['a', 'b', 'c']

In [5]:
df1 = pd.DataFrame(lst)

In [6]:
df1.head()

   0
0  a
1  b
2  c

In [7]:
lst_of_lst = [[1,2,3], [2,3,4], [4,5,6]]
print(lst_of_lst)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [8]:
df2 = pd.DataFrame(lst_of_lst)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [9]:
dict1 = {'ID': [11,22,33,44]}
dict1

{'ID': [11, 22, 33, 44]}

In [10]:
df3 = pd.DataFrame(dict1)

In [11]:
df3

   ID
0  11
1  22
2  33
3  44

In [14]:
dict2 = {'ID': [11,22,33,44], 'NO':[1,2,3,4]}
dict2

{'ID': [11, 22, 33, 44], 'NO': [1, 2, 3, 4]}

In [16]:
df4 = pd.DataFrame(dict2)
df4

   ID  NO
0  11   1
1  22   2
2  33   3
3  44   4

In [18]:
ls_dict = [{'a':1, 'b':2}, {'a':3, 'b':4}, {'c':5, 'd':42}]
df5 = pd.DataFrame(ls_dict)
df5

     a    b    c     d
0  1.0  2.0  NaN   NaN
1  3.0  4.0  NaN   NaN
2  NaN  NaN  5.0  42.0

#### Creating dataframe from dict of series

In [20]:
dict_sr = {'Id':pd.Series([1,2,3]), 'SN': pd.Series([121,22,33])}
df6 = pd.DataFrame(dict_sr)
df6

   Id   SN
0   1  121
1   2   22
2   3   33